#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "1a9187caf07e598a164478d42fa8fe80" -> "4033d08fe3754fcf9d9a3bda05feb572"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "138fce208455867cdf795c2157cedc06" -> "3373eb46e31a3c66c58089583b70068e"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "c1123ff65e58455c2803610a9c139e22" -> "4acb6466ebe728fef911a3c8cc519b5d"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "fdb22b03186e034d2f3ad36a8ac9c359" -> "52d8130e9aa0adb33038d1497755678b"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "a231e48c3825c28030c27db9e0762522" -> "966f5158a2205242221d38d141cb6f50"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3c74802ac168ad18370a9f18da5daf4a" -> "440fd29def4be3635f62b6a5b645a2f3"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "7780a3644ae34baea4133c41027a1077" -> "281d2efff23885c31a94740a2a20c813"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "299797f3ff7c4db9b9ef89e470a3f2dd" -> "c6638c0d63f6851d177f9e024fc9bd7b"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "a74f9553df3db6adf2f153d872e8d860" -> "7e70a04a9a447a057b1dab4badc7f4b6"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "a9e96dbf874739ace423d7db4b349a24" -> "f58898c064817f1c9fa45b2feb408dbd"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "d6a908d8bd9812de11063cc3b8c9aee9" -> "feb00988d6f1779f3921f10c244fdcd2"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "f3eb11b6122a44e7bf9e19a19bfed129" -> "8d27b562009d922cc920c64dcf5898f7"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "099462c75bbc35aad64420b3abc39b52" -> "56ecbf37e509a41d47783bdd9935a538"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "50b27f722a90029c64a48bfe8cdcf4e5" -> "8d29dbdc77f6189fd611905fd30117cf"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "18ca3c99a66eb872d249c3490029ed34" -> "f1f3afdc8c6e434e695610f8fa0060ed"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "99b554252bac292eb30aaf462d724c9e" -> "d2de912236d244b7204c08d76d40a7e3"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e18529d699f31c43c6d9eafba39d989e" -> "1c49ac0100a0fcf10469b59023b8631c"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "f36e8605fcd9e936796a88a406dd71b0" -> "bc7aab86ae8dde688b4534b83d4340c5"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "a5ae479002b6f16a560b5ccec763f3e7" -> "8bee426e8bddfa82ae34b860baaac2cc"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "415d53d97baa11dc0dab3ba758fa7b7a" -> "35a4325f1fcd302cf1a0e064eba2f83e"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "40dbf7d1124fce793d8a43a9bf521441" -> "69924a4b8b8c074f49bde759f1042c88"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "df9eac77089b99937a4a71d00af0b48e" -> "25602c02000c08b5b57ddc606a92a459"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "4f0f4ce63589fefe35b8c48c5c86d70a" -> "29f990befc5208e2606d05c8df767da5"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7dc88662e87e6e7761554adac895ace4" -> "8f213b0f19d4a350a862e7d100013c06"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "e3c8f5573556400524022efe3f0dbf15" -> "addda4c4a5b59d24a47a874e3f115d8a"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "499879305c585bd5403d803e2a16f9a8" -> "3967b958df784d0ce965a68e7f7307ac"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "fa293ecd20f81b6c6f5c864df2e3849a" -> "c0c3f35f35ecc7cd5dffedf76cbf5122"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "457ef580b09d15d2671bfe6af93c51dc" -> "8e5c73e0985aa78c4d7a5c0d5681d900"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "1bcc6f3537817de051ccdd97d707471f" -> "98ef9b119327b83d5b1dd7eaff5eb02a"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "f6a0bcdabe4c814892d1d22a15740f60" -> "8b972d7b539d01534420ac809c5491e3"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "a4cbb79da720dedc8e7544b2f15ef541" -> "9db4420a3cf72a7a4d3fdf3f0873ed7f"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ccd3aa0a1eab82590e3c7fbf6ef169d4" -> "474f5a6965518299b2e254f4cb2950db"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "0e4631e01fec92596df50d2db5186c79" -> "19b2743280e27b788559fbf82d7bf897"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "682e75b1caf450f69cadd1b7934c1daf" -> "cabc7cd4b89950545ee9faed075dfef3"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "c92f854ec3ab0bdbbf735bd8ad667ff9" -> "f7ec37b30346282c6cfa5e0b3c0d574f"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "4541bdc7d425655afc57bb6a017c4ea3" -> "ba91a92dba26abefa0545cde9fc863ed"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "6de3126cbc05066bef3960b24bbb456e" -> "3fd18ad55dfdd50e18dc68aba1e8992d"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "f806ab407aa795eb4f7d6a84bb92e072" -> "264d33dfdae7b37eeee9584718025b3f"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "3fab50b2cfbee531fb8a2ec71118dd53" -> "98c34b3ad3acf514a74612cd4bd27ae4"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "5630e63e86ce2377129a4647f5c85211" -> "65ce3d3fd42eceb880b9e5e784c9fa4b"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0a23d2a43a498e54f6bb0ac87e09f906" -> "f4708cf175cc370def35d2b7e4aee97e"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "972a8e8857b05d045f749fce9346e004" -> "6ee91714cdd87c7d6eb3072875f9f29c"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "bae2aaa22e35c2804cec31aa8579115f" -> "b196f8a1e1c748190ba8cc39c19ab860"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "bac493b72cd8eec4a9721f85b6891615" -> "a1782a576e013f7f2e4524bbd71d7676"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "ccff770714c5e867fa2c6e89d056d82c" -> "9dfcb1dab3e576735305debb67ca38f1"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "29eec7318948fc39aed191b40826a4a3" -> "c13e80ea325ced828ee28774d50b894c"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "15d4198afe2f5f8c93f2e51736bdd5f9" -> "e66990bfe7b09190e42fcf5de9cc8db8"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "VJzi2FZAjWs3gCL4yaWdfdoWVbbdeIAA8O5nCT/lSzc=" -> "sAr965qV/d39Ehh17fLkj8aUhTpxS8XI3JIxBE8nqn0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "HfsPnfFwAcCKIIRR3kIvjdOVsd5kWaaRa1k/HESLvyw=" -> "yMPSkh2dld9sCF4KBPK/hQen7hGSJ3UYYhUwPcy7mp8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "G0oZmQWS1IuPjJ7XxNs7Xp+P1DhHAuymm9Ke6AMC3b8=" -> "ZLwKnsCitG6eCHQhFFZI6pQUFB/W14PHZ112Fy4/5/4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "UHI16C/6AHoAq8VMWtvuAWvyRso6KO8Ytu1VazKbaPQ=" -> "l9bNJaLnph9QR3uX5Dtd3zMg3G+CZBXpPsrpnhrynLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "DA7Yk46+3X9vCyfgStYrt16zlwo6eBFej/SzGn5V3CQ=" -> "6twiuW4pRoXQuMIKO/T4rN5994lzEE4a+76ki5iEYak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZo9QajI4Pyzxp7DtwGVs/lTFZbTaWFr9UVHI78fglA=" -> "BaR5r9HGWY2Pyr0q5LgRE7Vo3mqrMeF1VzhhBAmumbY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k85PMPiIvePYFtySZIL7VSIFbxwnwf+B9byMlZig+Q=" -> "ERtYc4uPgoWoVueSdS6Eo2/G8IjGFMPmHiVx1m5Ia88="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "DYbVgi+8YHrYe7pGXzrm6ek93YeV+kIHNziI1pOoGKA=" -> "LwCasW8v0So+uc4WvuZc3dPt56VACy1J2Nfneoethzk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "1ywQdkuBJ/nEtZV7D88RKHFha+d5qeGeQhPY/RlLyx4=" -> "tmaOr8bno3phoZRd0Xpk41hs5pu8HifX/cjxkjsmBrM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "zATW/1W49/GwSXlgtYq3Fz/UxCXmjl2FnR4LA/V9MU0=" -> "oBABHn1v1VKdmX8UvtbjwVVkXXj7Ks5wdRtqAHCMvAc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LRcZXQ0vFBCUroGE6pAw4buAhLU4IaFAGwqXFPeOKRw=" -> "O6+JCeno+grVG+NZMWYl/Y9iBWOtfVoSLy2G7zPw4aM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoIDDv8t2G5DXlKnVXRmDmk27GDUHosU0swzEY63zlI=" -> "N4mqjYTJum3VIr9luoEiymIlnrBiHAS3g7mUAdiqImo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "kx1bsToC3y2yGpUUsEeSt99ZOqrE7jTTgi8C4xBJywg=" -> "yTclvSWEkfRHfclNOSidhwLu1GPrP34Zz5dLpQah8zw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "kWhev/K1zW2wAyWSh+F3gIydRp1gl6tntrag3zQ2aNA=" -> "UIH+y5cdbBh5OG+rabo8666NbkiOTRcL921p42jRycI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "PX3mSayp0CcYSsyoCrhgsG6+b/OI5GE2NGGRBLAsd2o=" -> "HCerx0X4JC3YCk2BacfJ/AVXV3CkT7ozmQnZTL5h87c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "PIPdwsYUi+hjvJSqqsojSrgWbe+RyxtU+r4cIKt459U=" -> "bxfiaM9O+T0wZBq4DpYSBCs7sGYH6emq3calVkcpLwk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "9hP3+UGOt2c6Kl/eylW7ei7QVUWbo5HxYBDaz5DhfFA=" -> "vwYkiVlmduuuH9asUtc1bVQvSH4TWrlzLLnnM6WY0xE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "biIy3xSjWPSuEp3/1l3GyHhi+jWJkV+s/S9ffh1Mu98=" -> "ciBq4xQPI4XDFxir6Sp7JR1BcYEZ+kN1cW7kj5qkQ9E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "T8xXPXa/LSn3msarzgtF5wwjfSDZCA8jew9D2VDsEuk=" -> "Y7quRhflJsip1raIfKy7MZ1psxeTKBGjJS+WHgreOYQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "K3ayvGV2Jes9mgXfkjcet7AvxB/TYn1f2vvNGZqTFQs=" -> "iR1Su5EPeJ4Z3OTSHVTFF0uzRhYnclJiOEnW/SdR6i4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xmG7coqLvkn5DPg+GQXITO78hcUWtDyNTjZBbqOcNwY=" -> "I9QJU+ypM+2fi7yVnzkRIRpmwL8WCEFzWpzGczk/1ks="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "d1nToCh0it2WqLEaIiz6XhpmzzA+AFUXiKM52Xu6U10=" -> "Hu/za3MHxCw3gto9tKg4k4Rlv12GFa+g887fF0L1UCQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/eQCpOiFic/fYSeHd1L5RzY32n2GqeK0klu1xWNex3M=" -> "7QhaLNd8PZgVDZ2tu9tQVG6TCua+7bIqsW6pLmE/TWU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rARbwgGSfqLhTNTcEmUiGsaV3PJCkOxFQGErlda6Kjk=" -> "AbFl3rkDtcotgRQOIORnUbwuiZM5WS1++dL4T1FTmxI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQNRRCnvfUEauOWa55m7I+xQQuy4DA2SsYxd6GXn450=" -> "b4pNakDrtOpwVw657VCAbchP4bNDr8s5rhzXe8VYBcE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "8N/uXKdcl83E3y6cjPq5Vo0L4RmwfJYzh/TiwZEgiKg=" -> "LZGZbPWZQaUSaDb+bkNVe0HiMENmD0Vd8vVpd04tMFc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rph39hHqJYN+OXMDpQfEvT9SyudPKsQCrI09Oaszq/M=" -> "v4A87YNFD10bTlWzylZ4JPf2PHbAfdTywP1sHu0sj0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "LmY1896e52qDZWkI3NuDYb2Yoow4PnheJygi8KVCRpI=" -> "zn0nHc7N/Cq2ZMfvVd5HxXKg9UpLYYpgNLilOXyZUQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "BMvOY6h3yZRrpu7SIO5slmo7Ub18OAmL9b0WggrrQnI=" -> "eDTs1N28By7mKk3sm6vaAaqpHqeXx9NPLeD5ixdTyZs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/6dfpuTjanEVov8jgWUoe4j9L25O5nPD/r5tGB2LAU=" -> "KSYOl9T5v2UEYT9WGGNGN5rxnXBIFTTT5ezB/KHwkE8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-28T19:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZHEauuuxs7NlOwzY7a07EZZ5at4kF7q/9KBd4XXNFls=" -> "dJijgTu8gzqiiy5cdV1xbHIvyK84GfEdEqR25b5nT0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "GfAOxrw/atfTjDf5Slf+h21iBbmHFZLv3AqbZoMBMqM=" -> "VaDh19+IRiQsUW2usWELkqe0UngBwLSSG0+AZFhmlNg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "xk56/2fDVt0nFuQ4ybtFGsYQweO4dzW31fHJqjcD4UY=" -> "0Gz/40771E970bqbjtJG+NVrC3i6V8/Uccc40NHtrew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "c5A7U6aVtpRZRERXUHknoOdyggTyWKONqa/TIQOSsWE=" -> "Ev2XiPgR4lYFArJssi7Baj3I/ZtalVFGsw53TVscmsA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xj9Q2SkaEJ8dUej7DvnHDx520J0/3JZk2+VNTvta560=" -> "US79bnVyI5GBxQKid3VwBFGeBS1EMoUtzB+TykmwItg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+YnPZGcYbYKNbf5MEgWMNH/ayzXSQl4DCPq29cKoV7Q=" -> "b6+QNSPyOOwdv3NbU/m4b5jhP0dswh0w62RnhEGcp1Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mok1sWN2I0vZpSz2LQ7Hya5Mv7+W4cTNqMS7PI+iYYY=" -> "3Z3l5m3Xrzv0Mtr58vguM46rWg00f6cOFZNFh3JYNOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MtkxsJONSm4xP2azLn7eSvAjiCLVNk04xctBr5Xp5Qw=" -> "O00j92cwiK5bvTYBgL4AsZJpaXVVCLuyJ04KdRzvt88="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "tNJ+auMsdJIf6WNHGHUMLs73sXQZTI019JIXI0Xrlg8=" -> "1du/MhpaWu3z/ojVh+l3Cqj7OPHwYhe1DcizJOQ4Sf4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "/zYmg18AUpLAQ3yCgrCyAj/08/Ar41PzX3mi7sAzG1I=" -> "RdogNV9H8D+yogzt9p5EqEbr7s4uJmlaRnqNS4IWA54="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "gua1kqpNTQVklaE7AoOyajWYC3UgQp2oYAb0vhR/M+U=" -> "PWpoVK+mfuqxdE+f2stnhWAMQN3JP8rLzXb76t6DNgM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "SCgMzA5srf2nA5kfdD697XtlWOpZZzKgydItBU7vQ2M=" -> "O3Vr5p31l73U239eiUxZNa/eDqOW5uLAhL0kxSbpXUU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ESeZnaifn72asVnZDCPDMIgKkOgXfYlm0PoEK8zuSf4=" -> "pNUxRYR5rOQs1uJMXo5ztENHE3HldT2kXnkVVhCSFWM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "/TZ1vGdMjchIyprAh+tyg6TGcWpl3MQ7mVLbnRCgSj0=" -> "wVO8khoS2h9RkzLhLJsTY/8/0LrNvd3LxP4sEp98zZI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "z10zdYdvtZH25sJVPWV2zeUNy14GR+P2dBQCtx1kH8I=" -> "OjnHtToyo4yqcvcEN0o14Bk7LNxbgrlLV+qa/cmzaTc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "a9Uhfb6/OPj58LqMguuslqsSuPPbvk66hDmDq0pJ5/Q=" -> "t4lNT3eXMvtDw2EtkY2Ywmq0hiutbdOqWyLNFX6qXUI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-25T06:34:22Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "edetfb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*